# 1. Import library

In [2]:
import json
import urllib.request
import pandas as pd
import numpy as np
import os,sys

# 2. Write function

# 3. Prepare data

In [3]:
with urllib.request.urlopen('https://gist.githubusercontent.com/first087/ac91f67c2022093a2e493295db9a385f/raw/266d21e3584b5b6e628e7eb621dfdfa41c6d54bc/input_round_8.json') as url:
    response = json.loads(url.read().decode())

In [4]:
data = json.loads(json.dumps(response).replace("'",'"'))

In [5]:
df = pd.DataFrame(data)

In [6]:
df.shape

(100, 5)

In [484]:
df.head()

,id,age,school,name,email
0,0,21,K,"{'first': 'Serena', 'last': 'Holman'}",serena.holman@undefined.net
1,1,32,D,"{'first': 'Freida', 'last': 'Herman'}",freida.herman@undefined.us
2,2,28,K,"{'first': 'Valarie', 'last': 'Talley'}",valarie.talley@undefined.biz
3,3,18,B,"{'first': 'Doyle', 'last': 'Holcomb'}",doyle.holcomb@undefined.tv
4,4,31,I,"{'first': 'Regina', 'last': 'Boyer'}",regina.boyer@undefined.biz

### กรองเงื่อนไขอายุ

In [8]:
data_filter_age_match = df[(df["age"] >= 22) & (df["age"] <= 28)]

In [9]:
# sort school
data_filter_age_match = data_filter_age_match.sort_values('school')

In [10]:
data_filter_age_match.shape

(45, 5)

In [485]:
data_filter_age_match.head()

,id,age,school,name,email
44,44,25,A,"{'first': 'Juana', 'last': 'Clay'}",juana.clay@undefined.me
60,60,25,A,"{'first': 'Carolina', 'last': 'Washington'}",carolina.washington@undefined.net
53,53,23,B,"{'first': 'Padilla', 'last': 'Watson'}",padilla.watson@undefined.name
83,83,22,B,"{'first': 'Maryanne', 'last': 'Baker'}",maryanne.baker@undefined.com
84,84,25,B,"{'first': 'Bentley', 'last': 'Spencer'}",bentley.spencer@undefined.net

### กรองเงื่อนไขอายุไม่เข้าเกณฑ์

In [12]:
data_filter_age_not_match = df[(df["age"] < 22) | (df["age"] > 28)]

In [13]:
data_filter_age_not_match.shape

(55, 5)

# 4. Process

In [462]:
result = {
    "1": [],
    "2": [],
    "3": []
}

In [463]:
max_room = 3

In [464]:
limit = 16

In [465]:
# ตัวแปรตรวจสอบกระจายผู้เข้าสอบไปห้องต่าง ๆ
check_room = 0

In [466]:
for person in data_filter_age_match.to_dict('r'):
    for room in range(max_room):
        if check_room == room:
            #print("{} append to {}".format(check_room,str(room+1)))
            result[str(room+1)].append(person)
            check_room += 1
            if check_room == 3:
                # reset 
                check_room = 0
            break

### concat rooms

In [467]:
room_1 = pd.DataFrame(result["1"])

In [468]:
# add label room
room_1["room"] = 1

In [469]:
room_1.head()

,id,age,school,name,email,room
0,44,25,A,"{'first': 'Juana', 'last': 'Clay'}",juana.clay@undefined.me,1
1,83,22,B,"{'first': 'Maryanne', 'last': 'Baker'}",maryanne.baker@undefined.com,1
2,54,28,B,"{'first': 'Faulkner', 'last': 'Kerr'}",faulkner.kerr@undefined.org,1
3,46,26,D,"{'first': 'Gladys', 'last': 'Mejia'}",gladys.mejia@undefined.ca,1
4,33,25,D,"{'first': 'Lucille', 'last': 'Hurley'}",lucille.hurley@undefined.info,1

In [470]:
room_1.shape

(15, 6)

In [471]:
room_2 =pd.DataFrame(result["2"])

In [472]:
# add label room
room_2["room"] = 2

In [473]:
room_2.head()

,id,age,school,name,email,room
0,60,25,A,"{'first': 'Carolina', 'last': 'Washington'}",carolina.washington@undefined.net,2
1,84,25,B,"{'first': 'Bentley', 'last': 'Spencer'}",bentley.spencer@undefined.net,2
2,58,27,B,"{'first': 'Sawyer', 'last': 'Grimes'}",sawyer.grimes@undefined.ca,2
3,39,23,D,"{'first': 'Jan', 'last': 'Walsh'}",jan.walsh@undefined.tv,2
4,80,28,E,"{'first': 'Compton', 'last': 'Flynn'}",compton.flynn@undefined.me,2

In [474]:
room_2.shape

(15, 6)

In [475]:
room_3 = pd.DataFrame(result["3"])

In [476]:
# add label room
room_3["room"] = 3

In [477]:
room_3.head()

,id,age,school,name,email,room
0,53,23,B,"{'first': 'Padilla', 'last': 'Watson'}",padilla.watson@undefined.name,3
1,68,28,B,"{'first': 'Estella', 'last': 'Jimenez'}",estella.jimenez@undefined.me,3
2,57,22,D,"{'first': 'England', 'last': 'Gillespie'}",england.gillespie@undefined.info,3
3,24,28,D,"{'first': 'Abby', 'last': 'Whitfield'}",abby.whitfield@undefined.net,3
4,36,24,E,"{'first': 'Morton', 'last': 'Emerson'}",morton.emerson@undefined.net,3

In [478]:
room_3.shape

(15, 6)

In [479]:
rooms_df = pd.DataFrame(room_1.to_dict('r') + room_2.to_dict('r') + room_3.to_dict('r'))

In [480]:
rooms_df.shape

(45, 6)

In [481]:
rooms_df.head()

,id,age,school,name,email,room
0,44,25,A,"{'first': 'Juana', 'last': 'Clay'}",juana.clay@undefined.me,1
1,83,22,B,"{'first': 'Maryanne', 'last': 'Baker'}",maryanne.baker@undefined.com,1
2,54,28,B,"{'first': 'Faulkner', 'last': 'Kerr'}",faulkner.kerr@undefined.org,1
3,46,26,D,"{'first': 'Gladys', 'last': 'Mejia'}",gladys.mejia@undefined.ca,1
4,33,25,D,"{'first': 'Lucille', 'last': 'Hurley'}",lucille.hurley@undefined.info,1

### Answer 1

In [497]:
# โรงเรียนที่ไม่มีผู้สมัครได้เข้าสอบเลย มีผู้สมัครสอบมากที่สุดกี่คน *
match_unique = set(data_filter_age_match["school"].to_list())
not_match_unique = set(data_filter_age_not_match["school"].to_list())
answer_1 = [sc for sc in not_match_unique if sc not in match_unique] 
answer_1 = [ answer_1[0] ,  df[df["school"] == answer_1[0]]["id"].count()]
answer_1

['C', 8]

### Answer 2

In [483]:
# จำนวนผู้ได้เข้าสอบมากที่สุดที่ได้นั่งอยู่ห้องเดียวกัน และมาจากโรงเรียนเดียวกัน *
rooms = rooms_df.groupby(["room","school"])["school"].count()
rooms[rooms == rooms.max()]

room  school
1     G         3
Name: school, dtype: int64

### Answer 3

In [283]:
# รายชื่อผู้ได้เข้าสอบที่น้อยที่สุด ที่มาจากโรงเรียนเดียวกัน *
# 1 คน ต่อ 1 บรรทัด
grouping_person_by_school = data_filter_age_match.groupby('school')["school"].count()
school = grouping_person_by_school[grouping_person_by_school == grouping_person_by_school.min()].index[0]
get_min_person  = data_filter_age_match[data_filter_age_match["school"] == school]
get_min_person

,id,age,school,name,email
61,61,25,L,"{'first': 'Cole', 'last': 'Maxwell'}",cole.maxwell@undefined.us